In [1]:
################ SQL LITE #############

import sqlite3

## Connect to an SQLite database
connection=sqlite3.connect('example.db')
connection

In [10]:
cursor=connection.cursor()

## Create a Table
cursor.execute('''
Create Table If Not Exists employees(
  id Integer Primary Key,
  name Text Not Null,
  age Integer,
  department text
  )
''')

## Commit the changes
connection.commit()

In [ ]:
## Insert the data in sqlite table
cursor.execute('''
Insert Into employees(name,age,department)
        values('Krish',32,'Data Scientist')

''')

cursor.execute('''
INSERT INTO employees (name, age, department)
VALUES ('Bob', 25, 'Engineering')
''')

cursor.execute('''
INSERT INTO employees (name, age, department)
VALUES ('Charlie', 35, 'Finance')
''')

## commi the changes
connection.commit()

[]

In [16]:
## Query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()

## print the queried data

for row in rows:
  print(row)

(1, 'Krish', 32, 'Data Scientist')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 35, 'Finance')
(4, 'Krish', 32, 'Data Scientist')
(5, 'Bob', 25, 'Engineering')
(6, 'Charlie', 35, 'Finance')
(7, 'Krish', 32, 'Data Scientist')
(8, 'Bob', 25, 'Engineering')
(9, 'Charlie', 35, 'Finance')
(10, 'Krish', 32, 'Data Scientist')
(11, 'Bob', 25, 'Engineering')
(12, 'Charlie', 35, 'Finance')
(13, 'Krish', 32, 'Data Scientist')
(14, 'Bob', 25, 'Engineering')
(15, 'Charlie', 35, 'Finance')
(16, 'Krish', 32, 'Data Scientist')
(17, 'Bob', 25, 'Engineering')
(18, 'Charlie', 35, 'Finance')

In [17]:
## Update the data in the table
cursor.execute('''
UPDATE employees
Set age=34
where name="Farhan"
''')

connection.commit()

In [18]:
## Query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()

## print the queried data

for row in rows:
  print(row)

(1, 'Krish', 32, 'Data Scientist')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 35, 'Finance')
(4, 'Krish', 32, 'Data Scientist')
(5, 'Bob', 25, 'Engineering')
(6, 'Charlie', 35, 'Finance')
(7, 'Krish', 32, 'Data Scientist')
(8, 'Bob', 25, 'Engineering')
(9, 'Charlie', 35, 'Finance')
(10, 'Krish', 32, 'Data Scientist')
(11, 'Bob', 25, 'Engineering')
(12, 'Charlie', 35, 'Finance')
(13, 'Krish', 32, 'Data Scientist')
(14, 'Bob', 25, 'Engineering')
(15, 'Charlie', 35, 'Finance')
(16, 'Krish', 32, 'Data Scientist')
(17, 'Bob', 25, 'Engineering')
(18, 'Charlie', 35, 'Finance')

In [19]:
## Query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()

## print the queried data

for row in rows:
  print(row)

(1, 'Krish', 32, 'Data Scientist')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 35, 'Finance')
(4, 'Krish', 32, 'Data Scientist')
(5, 'Bob', 25, 'Engineering')
(6, 'Charlie', 35, 'Finance')
(7, 'Krish', 32, 'Data Scientist')
(8, 'Bob', 25, 'Engineering')
(9, 'Charlie', 35, 'Finance')
(10, 'Krish', 32, 'Data Scientist')
(11, 'Bob', 25, 'Engineering')
(12, 'Charlie', 35, 'Finance')
(13, 'Krish', 32, 'Data Scientist')
(14, 'Bob', 25, 'Engineering')
(15, 'Charlie', 35, 'Finance')
(16, 'Krish', 32, 'Data Scientist')
(17, 'Bob', 25, 'Engineering')
(18, 'Charlie', 35, 'Finance')

In [20]:
## Working Wwith Sales Data
# Connect to an SQLite database
connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()

# Create a table for sales data
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales (
  id INTEGER PRIMARY KEY,
  date TEXT NOT NULL,
  product TEXT NOT NULL,
  sales INTEGER,
  region TEXT
)
''')

# Insert data into the sales table
sales_data = [
  ('2023-01-01', 'Product1', 100, 'North'),
  ('2023-01-02', 'Product2', 200, 'South'),
  ('2023-01-03', 'Product1', 150, 'East'),
  ('2023-01-04', 'Product3', 250, 'West'),
  ('2023-01-05', 'Product2', 300, 'North')
]

cursor.executemany('''
Insert into sales(date,product,sales,region)
          values(?,?,?,?)
''',sales_data)

connection.commit()

In [21]:
# Query data from the sales table
cursor.execute('SELECT * FROM sales')
rows = cursor.fetchall()

# Print the queried data
for row in rows:
  print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')

In [24]:
## CLOSE THE CONNECTION
connection.close()

In [39]:
############## Assignment ##############

# Database Connection (Ye students.db file create karega)

conn = sqlite3.connect("students.db")
cursor = conn.cursor()

In [29]:
# Tables Create
cursor.execute("""
CREATE TABLE IF NOT EXISTS Students (
    StudentID INTEGER PRIMARY KEY,
    Name TEXT,
    Age INTEGER,
    City TEXT
);
""")

cursor.execute("""
CREATE TABLE IF NOT EXISTS Courses (
    CourseID INTEGER PRIMARY KEY,
    CourseName TEXT,
    Teacher TEXT
);
""")

cursor.execute("""
CREATE TABLE IF NOT EXISTS Enrollments (
    EnrollmentID INTEGER PRIMARY KEY,
    StudentID INTEGER,
    CourseID INTEGER,
    FOREIGN KEY (StudentID) REFERENCES Students(StudentID),
    FOREIGN KEY (CourseID) REFERENCES Courses(CourseID)
);
""")

In [30]:
# Sample Data Insert
cursor.executemany("INSERT OR IGNORE INTO Students VALUES (?, ?, ?, ?)", [
    (1, 'Ali', 20, 'Lahore'),
    (2, 'Ayesha', 22, 'Karachi'),
    (3, 'Bilal', 19, 'Lahore'),
    (4, 'Sara', 21, 'Islamabad')
])

cursor.executemany("INSERT OR IGNORE INTO Courses VALUES (?, ?, ?)", [
    (101, 'Maths', 'Sir Hamza'),
    (102, 'English', 'Miss Sana'),
    (103, 'Computer Science', 'Sir Asad')
])

cursor.executemany("INSERT OR IGNORE INTO Enrollments VALUES (?, ?, ?)", [
    (1, 1, 101),
    (2, 1, 103),
    (3, 2, 102),
    (4, 3, 101),
    (5, 4, 103)
])

conn.commit()

In [ ]:
############### Queries #################

# 1. Select all students
print("\n All Students:")
for row in cursor.execute("SELECT * FROM Students"):
    print(row)

 All Students:
(1, 'Ali', 20, 'Lahore')
(2, 'Ayesha', 22, 'Karachi')
(3, 'Bilal', 19, 'Lahore')
(4, 'Sara', 21, 'Islamabad')

In [33]:
# 2. Students from Lahore
print("\n Students from Lahore:")
for row in cursor.execute("SELECT Name FROM Students WHERE City='Lahore'"):
    print(row)

 Students from Lahore:
('Ali',)
('Bilal',)

In [34]:
# 3. Students ordered by Age DESC
print("\n Students Ordered by Age (DESC):")
for row in cursor.execute("SELECT * FROM Students ORDER BY Age DESC"):
    print(row)

 Students Ordered by Age (DESC):
(2, 'Ayesha', 22, 'Karachi')
(4, 'Sara', 21, 'Islamabad')
(1, 'Ali', 20, 'Lahore')
(3, 'Bilal', 19, 'Lahore')

In [35]:
# 4. Students with Courses (JOIN)
print("\n Students with their Courses:")
for row in cursor.execute("""
SELECT s.Name, c.CourseName
FROM Students s
JOIN Enrollments e ON s.StudentID = e.StudentID
JOIN Courses c ON e.CourseID = c.CourseID
"""):
    print(row)

 Students with their Courses:
('Ali', 'Maths')
('Ali', 'Computer Science')
('Ayesha', 'English')
('Bilal', 'Maths')
('Sara', 'Computer Science')

In [40]:
# 5. Count total enrollments
cursor.execute("SELECT COUNT(*) FROM Enrollments")
total = cursor.fetchone()[0]
print(f"\n Total Enrollments: {total}")

 Total Enrollments: 5

In [37]:
conn.close()